Repository: cassis2k/container.desktop
Catalog: container.desktop/Localizable.xcstrings
Source language: en
Languages: fr

# common.cancel
source: Cancel
fr: Annuler

# common.error
source: Error
fr: Erreur

# containers.empty.title
source: No containers yet
fr: Aucun conteneur pour l'instant

# containers.title
source: Containers View
fr: Vue des conteneurs

# error.commandNotFound
source: Container command not found. Please ensure Apple Container is installed.
fr: Commande container introuvable. Veuillez vérifier qu'Apple Container est installé.

# error.executionFailed %lld %@
source: Command failed with exit code %lld: %@
fr: La commande a échoué avec le code %lld : %@

# error.invalidResponse
source: Invalid response received from server.
fr: Réponse invalide reçue du serveur.

# error.networkError %@
source: Network error: %@
fr: Erreur réseau : %@

# error.serviceNotInstalled
source: Apple Container is not installed. Please install it from https://github.com/apple/container
fr: Apple Container n'est pas installé. Veuillez l'installer depuis https://github.com/apple/container

# images.created
source: Created
fr: Créé

# images.delete.confirm
source: Delete
fr: Supprimer

# images.delete.message %@
source: Are you sure you want to delete the image "%@"? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer l'image « %@ » ? Cette action est irréversible.

# images.delete.title
source: Delete Image
fr: Supprimer l'image

# images.empty.title
source: No images yet
fr: Aucune image pour l'instant

# images.noImage
source: No images
fr: Aucune image

# images.pull
source: Pull Image
fr: Télécharger une image

# images.pull.confirm
source: Pull
fr: Télécharger

# images.pull.placeholder
source: e.g. alpine:latest
fr: ex. alpine:latest

# images.pull.reference
source: Image reference
fr: Référence de l'image

# images.pull.registry %@
source: Registry: %@
fr: Registre : %@

# images.pull.title
source: Pull a new image
fr: Télécharger une nouvelle image

# images.size
source: Size
fr: Taille

# images.system
source: System
fr: Système

# logs.noLogs
source: No logs
fr: Aucun journal

# logs.noLogsDescription
source: No system logs available
fr: Aucun journal système disponible

# logs.copied
source: Copied!
fr: Copié !

# logs.copyLine
source: Copy log line
fr: Copier la ligne

# logs.refresh
source: Refresh logs
fr: Actualiser les journaux

# logs.title
source: System Logs
fr: Journaux système

# navigation.containers
source: Containers
fr: Conteneurs

# navigation.logs
source: Logs
fr: Journaux

# navigation.network
source: Network
fr: Réseau

# navigation.selectItem
source: Select an item
fr: Sélectionnez un élément

# navigation.settings
source: Settings
fr: Paramètres

# network.create
source: Create Network
fr: Créer un réseau

# network.create.confirm
source: Create
fr: Créer

# network.create.labels
source: Labels (optional)
fr: Labels (optionnel)

# network.create.labels.empty
source: No labels
fr: Aucun label

# network.create.labels.key
source: Key
fr: Clé

# network.create.labels.value
source: Value
fr: Valeur

# network.create.name
source: Name
fr: Nom

# network.create.namePlaceholder
source: Network name
fr: Nom du réseau

# network.create.subnet
source: Subnet (optional)
fr: Sous-réseau (optionnel)

# network.create.subnetPlaceholder
source: e.g. 192.168.100.0/24
fr: ex. 192.168.100.0/24

# network.create.title
source: Create a new network
fr: Créer un nouveau réseau

# network.inUse
source: IN USE
fr: UTILISÉ

# network.notInUse
source: NOT IN USE
fr: NON UTILISÉ

# network.delete.confirm
source: Delete
fr: Supprimer

# network.delete.message %@
source: Are you sure you want to delete the network "%@"? Containers using this network will lose connectivity.
fr: Êtes-vous sûr de vouloir supprimer le réseau « %@ » ? Les conteneurs utilisant ce réseau perdront leur connectivité.

# network.delete.title
source: Delete Network
fr: Supprimer le réseau

# network.empty.createButton
source: Create my first network
fr: Créer mon premier réseau

# network.empty.description
source: Your containers are feeling a bit lonely... Give them a network so they can chat!
fr: Vos conteneurs se sentent un peu seuls... Offrez-leur un réseau pour qu'ils puissent papoter !

# network.empty.title
source: No network yet
fr: Aucun réseau pour l'instant

# network.gateway
source: Gateway
fr: Passerelle

# network.subnet
source: Subnet
fr: Sous-réseau

# network.title
source: Network configuration
fr: Configuration réseau

# settings.dataRoot
source: Data root
fr: Répertoire des données

# settings.dataRoot.description
source: The root directory where container stores its data.
fr: Le répertoire racine où container stocke ses données.

# settings.dns.domain
source: Domain
fr: Domaine

# settings.dns.domain.description
source: If defined, the local DNS domain to use for containers with unqualified names.
fr: Si défini, le domaine DNS local à utiliser pour les conteneurs sans nom qualifié.

# settings.edit
source: Edit...
fr: Modifier...

# settings.edit.title %@
source: Edit %@
fr: Modifier %@

# settings.images.builder
source: Builder
fr: Constructeur

# settings.images.builder.description
source: The image reference for the utility container that `container build` uses.
fr: La référence de l'image pour le conteneur utilitaire utilisé par `container build`.

# settings.images.init.description
source: The image reference for the default initial filesystem image.
fr: La référence de l'image pour le système de fichiers initial par défaut.

# settings.installRoot
source: Install root
fr: Répertoire d'installation

# settings.installRoot.description
source: The root directory where container is installed.
fr: Le répertoire racine où container est installé.

# settings.kernel.binaryPath
source: Binary path
fr: Chemin du binaire

# settings.kernel.binaryPath.description
source: If the kernel URL is for an archive, the archive member pathname for the kernel file.
fr: Si l'URL du noyau est une archive, le chemin du fichier noyau dans l'archive.

# settings.kernel.url.description
source: The URL for the kernel file to install, or the URL for an archive containing the kernel file.
fr: L'URL du fichier noyau à installer, ou l'URL d'une archive contenant le fichier noyau.

# settings.notDefined
source: Not defined
fr: Non défini

# settings.registry.domain
source: Domain
fr: Domaine

# settings.registry.domain.description
source: The default registry to use for image references that do not specify a registry.
fr: Le registre par défaut pour les références d'images qui ne spécifient pas de registre.

# settings.rosetta.description
source: Build amd64 images on arm64 using Rosetta, instead of QEMU.
fr: Compiler les images amd64 sur arm64 avec Rosetta au lieu de QEMU.

# settings.section.build
source: Build
fr: Compilation

# settings.section.kernel
source: Kernel
fr: Noyau

# settings.section.registry
source: Registry
fr: Registre

# settings.service.debug
source: Debug mode
fr: Mode débogage

# settings.service.debug.description
source: Enable debug logging for the container service. Takes effect on next restart.
fr: Activer les journaux de débogage pour le service conteneur. Prend effet au prochain redémarrage.

# settings.service.restart.confirm
source: Restart Service
fr: Redémarrer le service

# settings.service.restart.message
source: This will restart the container service. All running containers will be stopped.
fr: Cela redémarrera le service conteneur. Tous les conteneurs en cours d'exécution seront arrêtés.

# settings.service.restart.title
source: Restart Required
fr: Redémarrage requis

# settings.unableToRetrieve
source: Unable to retrieve
fr: Impossible de récupérer

# settings.version.description
source: The current version of container-apiserver.
fr: La version actuelle de container-apiserver.

# settings.version.updateAvailable %@
source: Update available: %@
fr: Mise à jour disponible : %@

# volumes.anonymous
source: ANONYMOUS
fr: ANONYME

# volumes.create
source: Create Volume
fr: Créer un volume

# volumes.create.confirm
source: Create
fr: Créer

# volumes.create.labels
source: Labels (optional)
fr: Labels (optionnel)

# volumes.create.labels.empty
source: No labels
fr: Aucun label

# volumes.create.labels.key
source: Key
fr: Clé

# volumes.create.labels.value
source: Value
fr: Valeur

# volumes.create.name
source: Name
fr: Nom

# volumes.create.namePlaceholder
source: Volume name
fr: Nom du volume

# volumes.create.size
source: Size (optional)
fr: Taille (optionnel)

# volumes.create.sizePlaceholder
source: Default: 512M
fr: Par défaut : 512M

# volumes.create.title
source: Create a new volume
fr: Créer un nouveau volume

# volumes.delete.confirm
source: Delete
fr: Supprimer

# volumes.delete.message %@
source: Are you sure you want to delete the volume "%@"? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le volume « %@ » ? Cette action est irréversible.

# volumes.delete.title
source: Delete Volume
fr: Supprimer le volume

# volumes.empty.createButton
source: Create my first volume
fr: Créer mon premier volume

# volumes.empty.title
source: No volumes yet
fr: Aucun volume pour l'instant

# volumes.size
source: Size
fr: Taille
